[
  {
    "title": "Energy Saving System",
    "text": "Smart Energy Management Panel with Custom Usage Limit and Load Monitoring     \n \nGroup  Members  Name  with  Roll No  , Section  & GL Name & Contact No:  \n \n \n \nS.No  Name  Roll No Sec Phone Number  \n1 ABDUL  SAMAD  KHAN(GL)  2021F -BCE-135 C 03320361015  \n2 M.FAHAM  2021F -BCE-08 A 03343338890  \n3 ISMAIL  KHAN  2021F -BCE-110 C 03313192494  \n4 AIMA  TAHIR  2021F -BCE-245 C 03352421884  \n \n1. Project  title \n \n \n \n \n \n \n2.Brief Project Desc ription  \n \nThe Smart Energy Management Panel  is an innovative solution designed to empower users with \nprecise control over their electricity consumption. This advanced panel integrates seamlessly with a \nmobile application, allowing users to set custom usage limits and monitor their electricity usage in \nreal time.  \nKey Features:  \n1. Custom Usage Limit Setting : \no Users can easily set their desired electricity consumption limit (in terms of monetary \nvalue) via the mobile app. This feature allows for better budgeting and management of \nelectricity expenses, ensuring that users do not exceed their predefined limits.  \n2. Real-Time Load Monitoring : \no The panel continuously monitors electricity usage, providing users with real -time data on \ntheir consumption. This information is displayed in the mobile app, enabling users to \ntrack how much electricity they are using and how much they have left from their set \nlimit. \n3. Mobile App Integration : \no The dedicated mobile app serves as the central control hub for the Smart Energy \nManagement Panel. Through the app, users can:  \n▪ Set and adjust their consumption limits.  \n▪ View historical usage data and trends.  \n▪ Receive notifications when they are approaching their usage limit.  \n▪ Monitor the status of connected appliances and manage them remotely.  \n4. Automated Load Control : \no The panel is equipped with relays that allow it to automatically control power to \nconnected appliances based on the user -defined limits. If the consumption approaches \nthe set limit, the panel can cut off power to non -essential devices, helping users stay \nwithin their budget.  \n \n \n \nSIR SYED  UNIVERSITY  OF ENGINEERING  & TECHNOLOGY  \nCOMPUTER  ENGINEERING DEPARTMENT  \nProposal  for the Final  Year  Project  Batch  2021f  \n5. Energy Efficiency Suggestions : \no The panel analyzes usage patterns and provides users with suggestions for improving \nenergy efficiency. Tips may include optimal times for running certain appliances or \nrecommendations for reducing overall consumption.  \n6. User -Friendly Interface : \no The mobile app features an intuitive interface that makes it easy for users to navigate \nand manage their electricity consumption. Clear graphics and real -time updates ensure \nusers can make informed decisions about their energy usage.  \n7. Alerts and Notifications : \no Users receive timely alerts when their electricity consumption is nearing the set limit or \nwhen unusual usage patterns are detected. This feature helps users take proactive \nmeasures to avoid exceeding their budgets.  \no  \no  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n3. How  would  you categorize  this project?  [Tick  only ONE]  \na. An effort  to facilitate  an existing  Research/  Industry  Project  \nb. An effort  to facilitate  developing  a Research/  Industry  Funded  Proposal  for possible  Funding  \nc. An effort  to facilitate  Master’s/ PhD  project  objectives  \nd. An exploratory  study  \ne. An experimental  study  for better  lab utilization/  development  \nf. A capstone  project  for students allowing  them  to apply  their learning  \ng. Other  (please  specify):     \n \n4. What  characteristics  of the Complex  Engineering  Problem  (CEP) are  applicable  to \nthis project?  [Tick  one or more,  if applicable]  \nh. Range  of conflicting  requirements:  technical,  engineering  or other  issues.  \ni. Depth  of analysis  required: have  no obvious solution  and require  abstract  thinking  \nj. Depth  of knowledge  required:  require  research -based  knowledge  \nk. Familiarity  of issues:  Involve  infrequently  encountered  issues  \nl. Extent  of applicable  codes: standards  and codes  devised  by the professional  bodies  \nm. Extent  of stakeholder  involvement  and level of conflicting  requirements  \nn. Consequences:  Impact  over the society  \no. Interdependence:  problems  due to dependability  \n \n• Research  and Analysis:  Studied  existing  electricity  meters  and user needs.  \n• Design  of the Meter:  Created  a prototype  design for  the advanced  meter.  \n• Basic  Functionality  Testing:  Developed  initial  software  to monitor  consumption  and \nrecharge balance.  \n \nFull System  Integration:  Integrated  load monitoring  capabilities  with the meter.  \nUser  Interface  Development: Developed a  mobile  or web app for users  to monitor  usage,  \nrecharge,  and receive  suggestions.  \nAlert System  Implementation:  Created  a notification  system  for low balance  and usage  patterns.     \n \n \n \n5. Brief  Objectives/Functionalities  Completed  before  Mid Evaluation:  \n \n \n \n \n6. Brief  Objectives/Functionalities  Completed  After  Mid Evaluation:  \n7. Scope  \n \n \n  Technological Development : \n• Create the energy management panel and a mobile app for monitoring and control.  \n  User Engagement : \n• Provide training and support; gather user feedback for improvements.  \n  Market Applicability : \n• Target residential users and small businesses; assess demand and competition.  \n  Regulatory Compliance : \n• Ensure safety standards and data privacy regulations are met.  \n  Future Expansion : \n• Explore renewable energy integration and additional features.  \n  Research and Development : \n• Continuously enhance the system and stay updated with technology trends.  \n \nSIR SYED  UNIVERSITY  OF ENGINEERING  & TECHNOLOGY  \nCOMPUTER  ENGINEERING DEPARTMENT  \nProposal  for the Final  Year  Project  Batch  2021f  \n \n \n \n• User -Centered Design:  Engaged  with potential  users  to understand their  needs  and \npreferences.  \n• Prototyping:  Created  prototypes  for the panel and user interface.  \n• Testing  and Iteration:  Conducted  user tests  to gather  feedback  and improve  \nfunctionalities.  \nExpected  Timeline  of the Project:  \n \nMonth  1-2: Research  and planning  \nMonth 3 -4: Design and hardware development  \nMonth  4-5: Software  development  and integration  \nMonth  5: Testing  and validation  \nMonth  6: Integration  of panel and mobile App and advanced  features  \nMonth  7: Final  deployment  and monitoring     \n \n8. Methodology:  \n \n \n9. Expected  Timeline  of the project  \n \n \nSIR SYED  UNIVERSITY  OF ENGINEERING  & TECHNOLOGY  \nCOMPUTER  ENGINEERING  DEPARTMENT  \nProposal  for the Final  Year  Project  Batch  2021f  \nSIR SYED  UNIVERSITY  OF ENGINEERING  & TECHNOLOGY  \nCOMPUTER  ENGINEERING  DEPARTMENT  \nProposal  for the Final  Year  Project  Batch  2021f   \nrome  \neakers  for \n*RS . \n. s \n. - \n- *Microcontroller* (e.g.,  Arduino/Raspberry  Pi) \n- *Display  unit*  (LCD/OLED)  \n- - *flex  sensors,  accele  ters:*  RS15000  \n- *Microcontroller:*  RS20000  \n- *Display  unit,  Sp audio  output:*  $ RS5000  \n- *Other  components  (casing,  wiring,  etc.):* $RS20000  000 \nMalicious  Cost  : 20000  \n- *Total  Estimated  Budget:*  RS80  \n• A functional  prototype  of the advanced  electricity  meter.  \n• A mobile  or web application  for user interaction.  \n• User  documentation  and a final report  detailing  the project  process.  \n12 Hardware/Component  used:  \n• Microcontroller  (e.g.,  Arduino,  ESP8266)  \n• Energy  monitoring  sensors  (e.g.,  current  sensors)  \n• LCD display  for real-time data \n• Communication modules  (e.g.,  Wi-Fi, GSM  for notifications)  \n• Rechargeable  power  supply  system   \n \n \n \n \n \n \n11. Project  Output:  \n \n \n \n13 Software  tools  used:  \n \n• Programming  languages (e.g.,  C++,  Python)  \n• Mobile  app development  frameworks  (e.g.,  Flutter,  React  Native)  \n• Database  for storing  usage  data (e.g.,  Firebase,  SQLite)  \n10 Expected  Budget  \n \n• current  sensors:  RS15000  \n• Microcontroller:  RS20000  \n• Display  unit, Wi-Fi, GSM:  $ RS5000  \n• Other  components  (casing, wiring,  etc.):  $RS20000  \n• Malicious  Cost:  RS20000  \n• Total  Estimated  Budget:  RS80000  \n\nSIR SYED  UNIVERSITY  OF ENGINEERING  & TECHNOLOGY  \nCOMPUTER  ENGINEERING  DEPARTMENT  \nProposal  for the Final  Year  Project  Batch  2021f   \n \nThis project  aligns with  the mission  to promote  sustainable  energy  practices  and \nimprove user engagement in energy consumption. It supports the following  \nSustainable  Development  Goals  (SDGs):  \n \n• SDG  7: Affordable  and Clean Energy  (promoting energy  efficiency  and \naccess)  \n• SDG  11: Sustainable  Cities  and Communities  (encouraging  responsible  \nenergy  use) \n• SDG  12: Responsible  Consumption and  Production  (fostering  efficient  \nresource  use).   \n \n \n14. Alignment  of project  with departmental/programme  mission  and SDGs . \n \nSIR SYED  UNIVERSITY  OF ENGINEERING  & TECHNOLOGY  \nCOMPUTER  ENGINEERING  DEPARTMENT  \nProposal  for the Final  Year  Project  Batch  2021f   \n \n \nName  of Proposed  Supervisor:  Signature:     \n \nName  of Proposed  Co- Supervisor  (if any):  Signature:     \n \n \nName  of Industrial  Advisor/External  (if any):  \n \nRecommendations  and Approval:  \n \n \n \nChairperson  Sign  with Date:  \n \n \n \n Head  of FYDP  Committee  Sign  with Date:"
  },
  {
    "title": "Smart Indoor Plantation",
    "text": "SIR SYED  UNIVERSITY  OF ENGINEERING  & TECHNOLOGY  \nCOMPUTER  ENGINEERING  DEPARTMENT  \nProposal  for the Final  Year  Project  Batch  2020   \n \n1. PROPOSED  TITLE  \n“SMART  HYDROPONICS  MANAGEMENT  SYSTEM”  \n \n2. How  would  you categorize  this project?  [Tick  only ONE]  \na. An effort  to facilitate  an existing  Research/ Industry  Project  \nb. An effort to  facilitate developing a Research/ Industry Funded Proposal for possible  \nFunding  \nc. An effort to  facilitate  Master’s/ PhD  project  objectives  \nd. An exploratory  study  \ne. An experimental  study  for better  lab utilization/  development  \nf. A capstone  project  for students allowing  them  to apply  their learning  \ng. Other  (please  specify):     \n \n3. What  characteristics  of the Complex  Engineering  Problem  (CEP)  are applicable  to \nthis project?  [Tick  one or more,  if applicable]  \na. Range  of conflicting  requirements:  technical,  engineering  or other  issues.  \nb. Depth  of analysis  required:  have  no obvious  solution  and require  abstract  thinking  \nc. Depth of  knowledge  required:  require  research -based  knowledge  \nd. Familiarity  of issues:  Involve  infrequently  encountered  issues  \ne. Extent  of applicable  codes:  standards  and codes  devised  by the professional  bodies  \nf. Extent  of stakeholder  involvement  and level of conflicting  requirements  \ng. Consequences:  Impact  over the society  \nh. Interdependence:  problems  due to dependability  \n \n4. BREIF  OUTLINE  \n \nAutomation  of hydroponics  involves manipulating its control  variables such as  moisture  content,  humidity,  \ntemperature,  PH, TDS,  light intensity  etc.) to produce  the ideal  and optimum  environment  for any plant’s  \ngrowth  and nurturing.  The aim of hydroponics  automation  is to minimize  labor  cost and increase  production  \nsubstantially,  resulting  in economic  benefit  for our Country.  For this purpose,  we have  designed  hydroponic  \nsystem.  After  analysis  of different  types  of materials,  selection  of ideal  materials  was made  for this \napplication.  Electricity  is supplied  to our system  using  solar  panels.  Sensor  nodes  at different  places  in \nsystem  are installed  to provide  more  accurate  knowledge  about  our control  variables  so that optimum  \nadjustment  can be applied  to each  area in green  house).  By using  Arduino,  green  house  is automated  by \nsending  appropriate  instructions  to actuators  for adjusting  control  variables.  For example,  when  soil moisture  \nis low, it is enhanced  by using  water  sprinkler  system.  To notify  the user about  any emergency,  an IOT \nbased  system  has been  installed  to extract  data on web server  and an Android  app has also been  designed  \nfor control  and monitor  of the system.  The costs  of this project  is kept low without  compromising  on efficiency  \nand performance,  thus,  to provide  a solution  suitable  for both industry  and farmers.  The technique  used  in \nthis greenhouse  chamber  to grow  plants  is known  as hydroponics.  The hydroponics  technique  is usually  \nused  to grow  shallow  roots  plants  and leafy plants  such  as tomato,  capsicum,  cucumber,  spinach,  lettuce,  \nmint,  coriander,  strawberry  and other  such  kind of plants.  The main  goal of this project  is to create  a \ngreenhouse  chamber  that will produce  vegetables  and herbs  round  the year.  \nSIR SYED  UNIVERSITY  OF ENGINEERING  & TECHNOLOGY  \nCOMPUTER  ENGINEERING  DEPARTMENT  \nProposal  for the Final  Year  Project  Batch  2020   \n5. OBJECTIVES  \n To grow  plants  using  hydroponic  system.  \n To monitor  real time condition  soil moisture,  humidity  and temperature  of area using  the \ndevice  \n To test the functionality  of this project  by implementing  it in suitable  condition.  \n Human  intervention  reduction  is the main  purpose  of this project.  \n To get notified  when someone  will get close  to the plant.  \n To provide  cost effective  and user friendly  system.  \n\n\n6. SCOPE  \nOur main  scope  of this project  is create  a system  that let anyone  have  the ability  to grow  plants  \nusing  an automated  indoor system.  \nWireless  update.  \nLess  expensive.  \nRequires  low maintenance.  \n \n7. METHODOLOGY  \n \nENVIRONMENTAL  REQUIREMENT  OF PLANTS: - \nWe can control  temperature  and humidity  according  to the requirement  through  Dht22  temperature  and \nhumidity  sensor.  \n \n \nNUTRIENTS  REQUIREMENTS  OF PLANTS: - \nIn hydroponic  system  nutrient  is directly  feed to the plant  roots,  so it is very necessary  to continuously                                                                                                                                                                \nmonitoring  the parameter  of nutrients  and any of them  is not match  it directly  affect  the plants  roots  \nand also the growth.  The parameter  which  can monitored  is PH, TDSand  E . \n \nCONTROLLING: - \nThe controlling  of the whole  process  can be done  by using  Arduino  mega  2560  with the help of relay  modules.  \nThe dht22,  PH, TDS and water  level are attached  to them.  The growing  led are to be controlled  because  \nplants  don’t  need  light for 24 hours.  \nSIR SYED  UNIVERSITY  OF ENGINEERING  & TECHNOLOGY  \nCOMPUTER  ENGINEERING  DEPARTMENT  \nProposal  for the Final  Year  Project  Batch  2020   \n \n8. EXPECTED  OUTCOME  OF THE PROPOSED  PROJECT  \n There  is no need  for client  to manually  monitor  for the plant’s  condition  and it will reduce  \nhuman’s  effort/work.  \n Provide  precise  climatic  conditions  for the plant,  water  the plants  automatically  while  the \nowner  wasn’t  there.  \n Data  may be accessible  in real time from anywhere  and at any time,  allowing  for live \nmonitoring and  end-to-end communication  among  all parties  involved.  \n \n9. EXPECTED  BUDGET  \n60 Thousand  rupees.  \n \n10. ATTACH  GANTT  CHART  OF FOR  THE PROJECT  WORK  \n \n \n\nSIR SYED  UNIVERSITY  OF ENGINEERING  & TECHNOLOGY  \nCOMPUTER  ENGINEERING  DEPARTMENT  \nProposal  for the Final  Year  Project  Batch  2020   \n11. HARDWARE  USED  \n Arduino  Mega2560  \n UNO  R3 + esp8266  \n WiFi  module  \n PH sensor  \n TDS  sensor  \n 4-Relay  module  \n Growing  LED  strips  \n Servo  motor  \n DHT 22 humidity  and temperature  sensor  \n DC pumps  12v and 1A \n DC fans  12V and 3.6A  \n Solar  panel 170W  \n MPPT  solar  battery  charger  \n Battery  100Ah  \n Light  sensor  \n Level  sensor  \n DC jumper  wires  3A \n \n12. SOFTWARE  TOOLS  USED  \nWe will  make  our own Web  Based  Application  which  will include:  \n HTML -CSS \n JavaScript  \n PHP \n Node  JS \n DataBase(SQL/MongoDB)  \n \n13. ALIGNMENT  OF PROJECT  WITH  DEPARTMENTAL/PROGRAMME  MISSION  AND  SDGS . \n Life on  Land: - \nOur project  “Smart Hydroponics  System”  fulfills the goal  Life on Land because  \nhydroponics  is a fastest  growing  sector  of agriculture  which  dominate  food \nproduction  in the future.  As population  increases  and arable  land declines  due \nto poor land management,  people  will turn to new technologies  like hydroponics  \nand vertica l farming  to create  additional  channels  of crop production.  \nSIR SYED  UNIVERSITY  OF ENGINEERING  & TECHNOLOGY  \nCOMPUTER  ENGINEERING  DEPARTMENT  \nProposal  for the Final  Year  Project  Batch  2020   \n \n \nName  of Supervisor:   Signature:  \n \nName  of Co- Supervisor  (if any):  Signature:  \n \nName  of Industrial  Advisor  (if any):  \n \nRecommendations  and Approval:  \n \n \n \n \n \nChairperson  (Head  of FYDP  Review  Committee)  Sign  with Date:"
  }
]